perf/root.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30 # la duracion esta en segundos
      arrivalRate: 5 # req por seg
      rampTo: 30
    - name: Plain
      duration: 120
      arrivalRate: 30
    # al final Grafana te replica el ultimo valor, siempre mandar un escenario que le des arrivalRate 0
    # para saber donde corto
    # nota: el primer pico de uso de CPU suele ser siempre exagerado, no tenerlo muy en cuenta.

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/' #endponit al que le vas a pegar